In [37]:
import pandas as pd

In [38]:
data = {
    '이름': ['아이유', '김연아', '홍길동', '장범준', '강감찬'],
    '학과': ['국문학', '수학', '컴퓨터', '철학', '경영학'],
    '성적': [3.0, 1.0, 3.5, 2.7, 4.0]
}

df = pd.DataFrame(data)

# 원하는 행번호와 열의 이름 정확히 입력
df.loc[0:, '이름']
# 원하는 행과, 열의 번호 입력
df.iloc[0:, 1]

0    국문학
1     수학
2    컴퓨터
3     철학
4    경영학
Name: 학과, dtype: object

In [41]:
# to_csv(저장경로와 파일이름 지정, 콤마로 구분, 저장시 인덱스 저장 유무)
df.to_csv('./student.csv', sep=',', index=False)

In [43]:
# csv 데이터 로딩
df = pd.read_csv('./student.csv')
display(df)

    이름   학과   성적
0  아이유  국문학  3.0
1  김연아   수학  1.0
2  홍길동  컴퓨터  3.5
3  장범준   철학  2.7
4  강감찬  경영학  4.0

In [ ]:
print(df[1:5]); print()
print(df[0:3]); print()
print(df[0:]); print()

In [ ]:
# print(df[1]) <- 에러 발생

df['이름']
df['성적']
df['학과']

In [ ]:
df[['학과', '이름']]

In [ ]:
print(df[['학과', '이름']][1:4]); print()
print(df[1:4][['이름', '학과']])
# 필드 순서 상관 없음, 인덱싱 순서 상관 없음

In [ ]:
df[ df['학과'] == '수학' ]

In [ ]:
print(df.loc[3]); print()
print(df.loc[[1, 2, 3]]); print()
print(df.loc[[1, 2, 3], :]); print()
# print(df.loc[[1, 2, 3], [0:1]]) <-- 불가능 열은 문자열로 주어야함
print(df.loc[[1, 2, 4], ['이름', '성적']]) # <-- [[행번호]. [열이름]]

In [ ]:
print(df.iloc[[1, 3, 4], 0:2]); print() # df.iloc[[행번호], 열인덱스]
print(df.iloc[[1, 3, 4], 0:3])

In [ ]:
df.loc[ df['성적'] % 2 != 0, ['이름', '학과', '성적']]

In [33]:
import numpy as np
import pandas as pd

In [35]:
import os
os.getcwd()

'c:\\Users\\yookim\\Documents\\A_Code\\TWL\\kimyoo04\\Pandas'

# 데이터 변경

### 지난 시간 저장한 csv 로딩

In [45]:
df = pd.read_csv('./student.csv')
display(df)

    이름   학과   성적
0  아이유  국문학  3.0
1  김연아   수학  1.0
2  홍길동  컴퓨터  3.5
3  장범준   철학  2.7
4  강감찬  경영학  4.0

In [46]:
df['등급'] = 'A' # 일괄 값 적용됨
df

    이름   학과   성적 등급
0  아이유  국문학  3.0  A
1  김연아   수학  1.0  A
2  홍길동  컴퓨터  3.5  A
3  장범준   철학  2.7  A
4  강감찬  경영학  4.0  A

### 컬럼과 값을 추가하는 방법 (numpy, pandas)
##### - 값을 넣을 때의 인덱스가 같아야하며, 길이도 같아야함!

In [50]:
# numpy 1d array 로 할당하는 방법
grade = np.array(['B', 'D', 'B', 'C', 'A'])
df['등급'] = grade
display(df)

# pandas의 Series 로 할당하는 방법 
age = pd.Series([21, 20, 24, 23, 28])
df['나이'] = age
display(df)

    이름   학과   성적 등급
0  아이유  국문학  3.0  B
1  김연아   수학  1.0  D
2  홍길동  컴퓨터  3.5  B
3  장범준   철학  2.7  C
4  강감찬  경영학  4.0  A

    이름   학과   성적 등급  나이
0  아이유  국문학  3.0  B  21
1  김연아   수학  1.0  D  20
2  홍길동  컴퓨터  3.5  B  24
3  장범준   철학  2.7  C  23
4  강감찬  경영학  4.0  A  28

### 컬럼과 값 추가

In [52]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [54]:
# 데이터 프레임의 인덱스 변경
df.index = ['one', 'two', 'three', 'four', 'five']
display(df)

        이름   학과   성적 등급  나이
one    아이유  국문학  3.0  B  21
two    김연아   수학  1.0  D  20
three  홍길동  컴퓨터  3.5  B  24
four   장범준   철학  2.7  C  23
five   강감찬  경영학  4.0  A  28

In [55]:
sex = pd.Series(['여자', '여자', '남자', '남자', '남자'])
df['성별'] = sex
display(df)

# 인덱스가 다르기 때문에 NaN으로 출력

        이름   학과   성적 등급  나이   성별
one    아이유  국문학  3.0  B  21  NaN
two    김연아   수학  1.0  D  20  NaN
three  홍길동  컴퓨터  3.5  B  24  NaN
four   장범준   철학  2.7  C  23  NaN
five   강감찬  경영학  4.0  A  28  NaN

In [56]:
# sex 의 인덱스 확인
sex.index

RangeIndex(start=0, stop=5, step=1)

In [57]:
# df 의 인덱스 확인
df.index

Index(['one', 'two', 'three', 'four', 'five'], dtype='object')

In [59]:
# sex와 df 인덱스 일치시키기
sex.index = df.index 

# 필드와 값 삽입
df['성별'] = sex
display(df)

        이름   학과   성적 등급  나이  성별
one    아이유  국문학  3.0  B  21  여자
two    김연아   수학  1.0  D  20  여자
three  홍길동  컴퓨터  3.5  B  24  남자
four   장범준   철학  2.7  C  23  남자
five   강감찬  경영학  4.0  A  28  남자

### 인덱스 리셋, 교체

In [64]:
# df.reset_index(drop=True, inplace=True) inplace=True 설정은 원본에 바로 적용됨
display(df.reset_index()) # 일시적인 적용

# 특정 필드를 인덱스로 사용
display(df.set_index('이름'))

   index   이름   학과   성적 등급  나이  성별
0    one  아이유  국문학  3.0  B  21  여자
1    two  김연아   수학  1.0  D  20  여자
2  three  홍길동  컴퓨터  3.5  B  24  남자
3   four  장범준   철학  2.7  C  23  남자
4   five  강감찬  경영학  4.0  A  28  남자

      학과   성적 등급  나이  성별
이름
아이유  국문학  3.0  B  21  여자
김연아   수학  1.0  D  20  여자
홍길동  컴퓨터  3.5  B  24  남자
장범준   철학  2.7  C  23  남자
강감찬  경영학  4.0  A  28  남자

### 컬럼 삭제

In [65]:
# df.drop(컬럼명, axis=1은 컬럼을 기준으로 삭제, inplace=True 인수를 주면 원본데이터에 반영)
df.drop('성별', axis=1, inplace=False)

        이름   학과   성적 등급  나이
one    아이유  국문학  3.0  B  21
two    김연아   수학  1.0  D  20
three  홍길동  컴퓨터  3.5  B  24
four   장범준   철학  2.7  C  23
five   강감찬  경영학  4.0  A  28

In [66]:
df.drop('나이', axis='columns') # axis=1 대신 columns로도 가능

        이름   학과   성적 등급  성별
one    아이유  국문학  3.0  B  여자
two    김연아   수학  1.0  D  여자
three  홍길동  컴퓨터  3.5  B  남자
four   장범준   철학  2.7  C  남자
five   강감찬  경영학  4.0  A  남자

### dataframe은 다른 변수에 할당해줘도 데이터 참조가 일어나지 않는다.

In [67]:
# 행 삭제 df.drop(인덱스값, 행축)
df.drop('one', axis=0)

        이름   학과   성적 등급  나이  성별
two    김연아   수학  1.0  D  20  여자
three  홍길동  컴퓨터  3.5  B  24  남자
four   장범준   철학  2.7  C  23  남자
five   강감찬  경영학  4.0  A  28  남자

### JSON 데이터 받아오기

In [85]:
from dotenv import load_dotenv # https://blog.gilbok.com/how-to-use-dot-env-in-python/
import requests
import json
import os

load_dotenv()

store_endpoint = os.environ.get('store_endpoint')
store_key = os.environ.get('store_key')
store_divide_id = 'indsLclsCd'
store_numOfRows = 100
store_pageNo = 0

url = f'{store_endpoint}/storeListInUpjong?divId={store_divide_id}&key=Q&numOfRows={store_numOfRows}&pageNo={store_pageNo}&type=json&serviceKey={store_key}'

response = requests.get(url) # API GET 요청

response.encoding = 'utf-8' # 인코딩 방식 설정

print(response.text[0:400]) # reponse 객체의 text 출력

{
	"header" : {
		"description" : "소상공인시장진흥공단 주요상권내 상가업소정보"
		,"columns" : ["상가업소번호","상호명","지점명","상권업종대분류코드","상권업종대분류명","상권업종중분류코드","상권업종중분류명","상권업종소분류코드","상권업종소분류명","표준산업분류코드","표준산업분류명","시도코드","시도명","시군구코드","시군구명","행정동코드","행정동명","법정동코드","법정동명","PNU코드","대지구분코드","대지구분명","지번본번지","지번부번지","지번주소","도로명코드","도로명","건물본번지","건물부번지","건물관리번호","건물명","도로명주소","구우편번호","신우편번호","동정보","층정보","호정보","경도","위도"]
		,"stdrY

In [86]:
# json -> dict 
resulting_dict = json.loads(response.text)

resulting_dict.keys()

dict_keys(['header', 'body'])

In [87]:
resulting_dict['body'].keys()

dict_keys(['items', 'numOfRows', 'pageNo', 'totalCount'])

In [88]:
resulting_dict['body']['items'][0]

{'bizesId': '10000982',
 'bizesNm': '이웃사촌',
 'brchNm': '',
 'indsLclsCd': 'Q',
 'indsLclsNm': '음식',
 'indsMclsCd': 'Q01',
 'indsMclsNm': '한식',
 'indsSclsCd': 'Q01A01',
 'indsSclsNm': '한식/백반/한정식',
 'ksicCd': 'I56111',
 'ksicNm': '한식 음식점업',
 'ctprvnCd': '45',
 'ctprvnNm': '전라북도',
 'signguCd': '45111',
 'signguNm': '전주시',
 'adongCd': '4511170200',
 'adongNm': '삼천2동',
 'ldongCd': '4511113700',
 'ldongNm': '삼천동1가',
 'lnoCd': '4511113700106950005',
 'plotSctCd': '1',
 'plotSctNm': '대지',
 'lnoMnno': 695,
 'lnoSlno': 5,
 'lnoAdr': '전라북도 전주시 완산구 삼천동1가 695-5',
 'rdnmCd': '451114598396',
 'rdnm': '전라북도 전주시 완산구 하거마1길',
 'bldMnno': 32,
 'bldSlno': '',
 'bldMngNo': '4511113700106950005025264',
 'bldNm': '',
 'rdnmAdr': '전라북도 전주시 완산구 하거마1길 32, (삼천동1가)',
 'oldZipcd': '560812',
 'newZipcd': '55088',
 'dongNo': '',
 'flrNo': '1',
 'hoNo': '',
 'lon': 127.117866794928,
 'lat': 35.7930153087836}

### dict 데이터를 컬럼별 리스트에 담기

In [89]:
# 각 키의 값마다 리스트에 담을 변수 초기화
store_name_list = []
store_kind_list = []
address_list = []
latitude_list = []
longitude_list = []

# dictionary 속 데이터 정보 입력
for tmp in resulting_dict['body']['items']:
    store_name_list.append(tmp['bizesNm'])
    store_kind_list.append(tmp['indsMclsNm'])
    address_list.append(tmp['lnoAdr'])
    latitude_list.append(tmp['lat'])
    longitude_list.append(tmp['lon'])
    
print(store_name_list[:10])
print(store_kind_list[:10])
print(address_list[:10])
print(latitude_list[:10])
print(longitude_list[:10])

['이웃사촌', '이조숯불갈비', '이창명의짜장면시키신분', '이포천서리막국수본점', '인수분식', '인천기공', '일광숯가마가든', '일동참숯불구이', '일미가든', '일미생삽겹살']
['한식', '한식', '중식', '분식', '분식', '유흥주점', '한식', '한식', '한식', '한식']
['전라북도 전주시 완산구 삼천동1가 695-5', '경상남도 남해군 미조면 미조리 111-3', '경기도 안양시 동안구 비산동 1101-2', '경기도 광주시 장지동 77-8', '세종특별자치시 조치원읍 신흥리 10-7', '인천광역시 남동구 고잔동 642-5', '경상북도 경주시 외동읍 구어리 148-1', '경기도 안산시 상록구 일동 601-34', '전라북도 부안군 하서면 언독리 543-2', '전라남도 담양군 담양읍 지침리 114-6']
[35.7930153087836, 34.7131927447173, 37.3965021686581, 37.3950743807212, 36.5970986229857, 37.4029167472593, 35.7002987266103, 37.311218307336, 35.7135909555964, 35.3155550161523]
[127.117866794928, 128.044802106761, 126.948952854363, 127.244487450922, 127.293883803151, 126.702129162996, 129.331720476686, 126.866254953139, 126.660007269146, 126.984945764921]

### dataframe 으로 변환

In [90]:
df = pd.DataFrame(
    {
        'name':store_name_list,
        'kind':store_kind_list,
        'address':address_list,
        'latitude':latitude_list,
        'longitude':longitude_list,
    }
)

display(df)

           name kind                   address   latitude   longitude
0          이웃사촌   한식  전라북도 전주시 완산구 삼천동1가 695-5  35.793015  127.117867
1        이조숯불갈비   한식    경상남도 남해군 미조면 미조리 111-3  34.713193  128.044802
2   이창명의짜장면시키신분   중식    경기도 안양시 동안구 비산동 1101-2  37.396502  126.948953
3    이포천서리막국수본점   분식          경기도 광주시 장지동 77-8  37.395074  127.244487
4          인수분식   분식     세종특별자치시 조치원읍 신흥리 10-7  36.597099  127.293884
..          ...  ...                       ...        ...         ...
95        진미청국장   한식        전라북도 남원시 신촌동 410-3  35.409339  127.394183
96        진미해장국   한식   경기도 성남시 중원구 하대원동 132-11  37.429835  127.149768
97         진솔식당   한식   경상북도 청도군 화양읍 범곡리 134-13  35.648019  128.734324
98         진수성찬   한식      인천광역시 부평구 삼산동 167-10  37.518886  126.740994
99         진수식당   한식       전라남도 여수시 화장동 846-11  34.776750  127.643774

[100 rows x 5 columns]

# 데이터 합치기

### DataFrame 병합 구현 방법 (조인)

In [94]:
data1 = {
    '학번': [1, 2, 3, 4],
    '이름': ['아이유', '김연아', '홍길동', '강감찬'],
    '학과': ['철학', '경영학', '컴퓨터', '물리학']
}

data2 = {
    '학번': [1, 2, 4, 5],
    '학년': [2, 4, 3, 1],
    '학점': [1.5, 2.0, 4.1, 3.8]
}

df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)

display(df1)
display(df2)

   학번   이름   학과
0   1  아이유   철학
1   2  김연아  경영학
2   3  홍길동  컴퓨터
3   4  강감찬  물리학

   학번  학년   학점
0   1   2  1.5
1   2   4  2.0
2   4   3  4.1
3   5   1  3.8

In [96]:
# inner join 사용
inner_df = pd.merge(df1, df2, on='학번', how='inner')
display(inner_df)

   학번   이름   학과  학년   학점
0   1  아이유   철학   2  1.5
1   2  김연아  경영학   4  2.0
2   4  강감찬  물리학   3  4.1

In [98]:
# outer join 사용
outer_df = pd.merge(df1, df2, on='학번', how='outer')
display(outer_df)

   학번   이름   학과   학년   학점
0   1  아이유   철학  2.0  1.5
1   2  김연아  경영학  4.0  2.0
2   3  홍길동  컴퓨터  NaN  NaN
3   4  강감찬  물리학  3.0  4.1
4   5  NaN  NaN  1.0  3.8

In [102]:
# left and right join
left_df = pd.merge(df1, df2, on='학번', how='left')
display(left_df) # df1 의 학번을 기준으로 merge

right_df = pd.merge(df1, df2, on='학번', how='right')
display(right_df) # df2 의 학번을 기준으로 merge

   학번   이름   학과   학년   학점
0   1  아이유   철학  2.0  1.5
1   2  김연아  경영학  4.0  2.0
2   3  홍길동  컴퓨터  NaN  NaN
3   4  강감찬  물리학  3.0  4.1

   학번   이름   학과  학년   학점
0   1  아이유   철학   2  1.5
1   2  김연아  경영학   4  2.0
2   4  강감찬  물리학   3  4.1
3   5  NaN  NaN   1  3.8

## 현실에서 일어날 법한 merge의 응용

#### 같은 의미의 값이지만 다른 컬럼명인 경우

In [103]:
data1 = {
    '학번': [1, 2, 3, 4],
    '이름': ['아이유', '김연아', '홍길동', '강감찬'],
    '학과': ['철학', '경영학', '컴퓨터', '물리학']
}

data2 = {
    '학생고유번호': [1, 2, 4, 5], 
    '학년': [2, 4, 3, 1],
    '학점': [1.5, 2.0, 4.1, 3.8]
}

df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)

In [104]:
display(df1)

   학번   이름   학과
0   1  아이유   철학
1   2  김연아  경영학
2   3  홍길동  컴퓨터
3   4  강감찬  물리학

In [105]:
display(df2)

   학생고유번호  학년   학점
0       1   2  1.5
1       2   4  2.0
2       4   3  4.1
3       5   1  3.8

In [106]:
# left_on 과 right_on 을 통해 임의로 특정 컬럼을 기준으로 병합하도록 함
merged_df = pd.merge(df1, df2, left_on='학번', right_on='학생고유번호', how='inner')
display(merged_df)

   학번   이름   학과  학생고유번호  학년   학점
0   1  아이유   철학       1   2  1.5
1   2  김연아  경영학       2   4  2.0
2   4  강감찬  물리학       4   3  4.1

In [107]:
# 불필요한 컬럼 임시 제거
merged_df.drop('학생고유번호', axis=1) # 원본 수정은 inplace=True 인자 넣기

   학번   이름   학과  학년   학점
0   1  아이유   철학   2  1.5
1   2  김연아  경영학   4  2.0
2   4  강감찬  물리학   3  4.1

#### 공유하는 컬럼이 없는 경우

In [108]:
data1 = {
    '학번': [1, 2, 3, 4],
    '이름': ['아이유', '김연아', '홍길동', '강감찬'],
    '학과': ['철학', '경영학', '컴퓨터', '물리학']
}

data2 = {
    '학년': [2, 4, 3, 1],
    '학점': [1.5, 2.0, 4.1, 3.8]
}


df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2, index=[1, 2, 4, 5])

In [109]:
display(df1)

   학번   이름   학과
0   1  아이유   철학
1   2  김연아  경영학
2   3  홍길동  컴퓨터
3   4  강감찬  물리학

In [110]:
display(df2)

   학년   학점
1   2  1.5
2   4  2.0
4   3  4.1
5   1  3.8

In [111]:
# left_index 과 right_index 왼쪽, 오른쪽 df의 인덱스를 기준으로 병합
merged_df = pd.merge(df1, df2, left_index=True, right_index=True, how='inner')
display(merged_df)

   학번   이름   학과  학년   학점
1   2  김연아  경영학   2  1.5
2   3  홍길동  컴퓨터   4  2.0

In [112]:
# 왼쪽은 학번을 기준으로, 오른쪽은 인덱스를 기준으로 병합
merged_df = pd.merge(df1, df2, left_on='학번', right_index=True, how='inner')
display(merged_df)

   학번   이름   학과  학년   학점
0   1  아이유   철학   2  1.5
1   2  김연아  경영학   4  2.0
3   4  강감찬  물리학   3  4.1

In [114]:
# 인덱스로 조인하는 방식은 join 메소드를 사용하는 것 편함
df1.join(df2, how='inner')

   학번   이름   학과  학년   학점
1   2  김연아  경영학   2  1.5
2   3  홍길동  컴퓨터   4  2.0

#### 데이터 연결 pandas.concat

In [115]:
import numpy as np
import pandas as pd

np.random.seed(1) # 고정 난수 설정

In [120]:
df1 = pd.DataFrame(np.random.randint(0, 9, (3,2)), # 3x2 난수값 행렬
                    index=['a', 'b', 'c'], # 인덱스 값 설정
                    columns=['one', 'two']) # 컬럼 값 설정

display(df1)

   one  two
a    6    1
b    0    1
c    8    8

In [121]:
df2 = pd.DataFrame(np.random.randint(0, 9, (2,2)), # 3x2 난수값 행렬
                    index=['a', 'b'], # 인덱스 값 설정
                    columns=['three', 'four']) # 컬럼 값 설정

display(df2)

   three  four
a      3     8
b      7     3

In [123]:
# df1 & df2 concat으로 연결
concat_dict1 = pd.concat([df1, df2], axis=1) # axis=1은 오른쪽 옆으로 붙이기 axis=0은 밑으로 붙이기
display(concat_dict1)

   one  two  three  four
a    6    1    3.0   8.0
b    0    1    7.0   3.0
c    8    8    NaN   NaN

In [125]:
# df1 & df2 concat으로 연결
concat_dict2 = pd.concat([df1, df2], axis=0) # axis=1은 오른쪽 옆으로 붙이기 axis=0은 밑으로 붙이기
display(concat_dict2) # 컬럼명을 공유하고 있지 않아서 컬럼이 새로 추가됨

   one  two  three  four
a  6.0  1.0    NaN   NaN
b  0.0  1.0    NaN   NaN
c  8.0  8.0    NaN   NaN
a  NaN  NaN    3.0   8.0
b  NaN  NaN    7.0   3.0

# 데이터 그룹핑

#### Groupby 메소드, apply(함수)

#### 집계 함수
- count
- sum
- mean, median
- min, max
- var, std
- first, last
- Describe
- aggregate or agg
- apply

#### Groupby 객체

- Groupby 객체는 반복문 이용 가능
- Groupby 객체는 **그룹 이름, 그룹별 데이터**를 **튜플 형태**로 갖고 있음
- 각 그룹별 데이터는 원래의 인덱스 값을 가지고 있음

#### 정렬 함수 sort_values(by='사용자 수', ascending=False)
ex) sort_values(by=['강좌 개수', '개발년도'], ascending=False)

In [126]:
import numpy as np
import pandas as pd

In [127]:
df = pd.DataFrame({
    '학과': ['수학', '화학', '수학', '화학', '수학'],
    '이름': ['로버트', '앤드류', '유진', '제이슨', '제이크'],
    '학년': [1, 2, 3, 2, 3],
    '학점': [1.5, 2.7, 3.5, 1.9, 4.0],
})

display(df)

   학과   이름  학년   학점
0  수학  로버트   1  1.5
1  화학  앤드류   2  2.7
2  수학   유진   3  3.5
3  화학  제이슨   2  1.9
4  수학  제이크   3  4.0

#### 1 단계 그룹핑

In [128]:
df_dept = df.groupby('학과') # dataframe의 특정 컬럼을 기준으로 그룹화

In [130]:
display(df_dept)
# <pandas.core.groupby.generic.DataFrameGroupBy object at 0x000001748DC740A0> 객체 주소 출력됨

In [131]:
# 학과별 기술통계 출력
df_dept.describe()

      학년                                                 학점                 \
   count      mean       std  min  25%  50%  75%  max count mean       std
학과
수학   3.0  2.333333  1.154701  1.0  2.0  3.0  3.0  3.0   3.0  3.0  1.322876
화학   2.0  2.000000  0.000000  2.0  2.0  2.0  2.0  2.0   2.0  2.3  0.565685


    min  25%  50%   75%  max
학과
수학  1.5  2.5  3.5  3.75  4.0
화학  1.9  2.1  2.3  2.50  2.7

In [132]:
# 학과별 원소 개수 출력
df_dept.count()

    이름  학년  학점
학과
수학   3   3   3
화학   2   2   2

In [133]:
# Series 그룹화
dept = df['학점'].groupby(df['학과']) # 학과별 학점으로 그룹화
print(dept)

<pandas.core.groupby.generic.SeriesGroupBy object at 0x000001748DC402B0>

In [134]:
dept.mean()

학과
수학    3.0
화학    2.3
Name: 학점, dtype: float64

In [135]:
dept.std()

학과
수학    1.322876
화학    0.565685
Name: 학점, dtype: float64

In [136]:
dept.size()

학과
수학    3
화학    2
Name: 학점, dtype: int64

In [137]:
# 수학과 인원 학점 데이터만 따로 반환
math = dept.get_group('수학')

math

0    1.5
2    3.5
4    4.0
Name: 학점, dtype: float64

#### 2 단계 그룹핑

In [138]:
dept = df.groupby([df['학과'], df['학년']]) # 학과별 학년별 그룹화 진행
dept

In [140]:
# 그룹별 기술통계 도출
dept.describe()

         학점
      count  mean       std  min    25%   50%    75%  max
학과 학년
수학 1    1.0  1.50       NaN  1.5  1.500  1.50  1.500  1.5
   3    2.0  3.75  0.353553  3.5  3.625  3.75  3.875  4.0
화학 2    2.0  2.30  0.565685  1.9  2.100  2.30  2.500  2.7

In [141]:
display(dept.mean())

C:\Users\yookim\AppData\Local\Temp\ipykernel_9888\1315140683.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  display(dept.mean())

         학점
학과 학년
수학 1   1.50
   3   3.75
화학 2   2.30

In [142]:
# 데이터 추가
df2 = pd.DataFrame({
    '학과': ['화학', '수학', '화학', '수학'],
    '이름': ['앤디', '제니', '엘리스', '멜리샤'],
    '학년': [1, 2, 3, 2],
    '학점': [3, 4.2, 3.1, 4.5]
})

concat_df = pd.concat([df, df2], axis=0)
concat_df.reset_index(inplace=True, drop=True)
display(concat_df)

   학과   이름  학년   학점
0  수학  로버트   1  1.5
1  화학  앤드류   2  2.7
2  수학   유진   3  3.5
3  화학  제이슨   2  1.9
4  수학  제이크   3  4.0
5  화학   앤디   1  3.0
6  수학   제니   2  4.2
7  화학  엘리스   3  3.1
8  수학  멜리샤   2  4.5

In [143]:
dept_and_year = concat_df.groupby([concat_df['학과'], concat_df['학년']])

In [144]:
dept_and_year.describe()

         학점
      count  mean       std  min    25%   50%    75%  max
학과 학년
수학 1    1.0  1.50       NaN  1.5  1.500  1.50  1.500  1.5
   2    2.0  4.35  0.212132  4.2  4.275  4.35  4.425  4.5
   3    2.0  3.75  0.353553  3.5  3.625  3.75  3.875  4.0
화학 1    1.0  3.00       NaN  3.0  3.000  3.00  3.000  3.0
   2    2.0  2.30  0.565685  1.9  2.100  2.30  2.500  2.7
   3    1.0  3.10       NaN  3.1  3.100  3.10  3.100  3.1

In [145]:
dept_and_year.mean().index

C:\Users\yookim\AppData\Local\Temp\ipykernel_9888\2660431472.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  dept_and_year.mean().index

MultiIndex([('수학', 1),
            ('수학', 2),
            ('수학', 3),
            ('화학', 1),
            ('화학', 2),
            ('화학', 3)],
           names=['학과', '학년'])

#### apply(인덱싱하는 함수) 메소드 사용

In [146]:
def top3_dept_scorer(df):
    return df.sort_values(by='학점', ascending=False)[:3]

In [147]:
# 학과별 그룹화 
dept = concat_df.groupby('학과')

In [148]:
dept.apply(top3_dept_scorer)

      학과   이름  학년   학점
학과
수학 8  수학  멜리샤   2  4.5
   6  수학   제니   2  4.2
   4  수학  제이크   3  4.0
화학 7  화학  엘리스   3  3.1
   5  화학   앤디   1  3.0
   1  화학  앤드류   2  2.7

In [151]:
display(dept.apply(top3_dept_scorer)['이름']) # 멀티 인덱스이기 때문에 이상하게 출력되는 모습

학과
수학  8    멜리샤
    6     제니
    4    제이크
화학  7    엘리스
    5     앤디
    1    앤드류
Name: 이름, dtype: object

#### groupby, apply, 람다 함수 한번에 사용

In [155]:
# 위아래 똑같은 결과 나옴
# concat_df.groupby(concat_df['학년']).apply(lambda x: x.sort_values(by='학점'))
concat_df.groupby('학년').apply(lambda x: x.sort_values(by='학점'))

      학과   이름  학년   학점
학년
1  0  수학  로버트   1  1.5
   5  화학   앤디   1  3.0
2  3  화학  제이슨   2  1.9
   1  화학  앤드류   2  2.7
   6  수학   제니   2  4.2
   8  수학  멜리샤   2  4.5
3  7  화학  엘리스   3  3.1
   2  수학   유진   3  3.5
   4  수학  제이크   3  4.0

#### groupby는 시퀸스 객체라서 for loop 가능

In [156]:
for dept, group in concat_df.groupby('학과'):
    print(f'학과: {dept}')
    display(group)

학과: 수학

   학과   이름  학년   학점
0  수학  로버트   1  1.5
2  수학   유진   3  3.5
4  수학  제이크   3  4.0
6  수학   제니   2  4.2
8  수학  멜리샤   2  4.5

학과: 화학

   학과   이름  학년   학점
1  화학  앤드류   2  2.7
3  화학  제이슨   2  1.9
5  화학   앤디   1  3.0
7  화학  엘리스   3  3.1

#### 2차 그룹핑 for loop

In [159]:
for (dept, year), group in concat_df.groupby(['학과', '학년']):
    print('-' * 25)
    print('학과: ', dept, '/ 학년: ', year)
    display(group)

-------------------------
학과:  수학 / 학년:  1

   학과   이름  학년   학점
0  수학  로버트   1  1.5

-------------------------
학과:  수학 / 학년:  2

   학과   이름  학년   학점
6  수학   제니   2  4.2
8  수학  멜리샤   2  4.5

-------------------------
학과:  수학 / 학년:  3

   학과   이름  학년   학점
2  수학   유진   3  3.5
4  수학  제이크   3  4.0

-------------------------
학과:  화학 / 학년:  1

   학과  이름  학년   학점
5  화학  앤디   1  3.0

-------------------------
학과:  화학 / 학년:  2

   학과   이름  학년   학점
1  화학  앤드류   2  2.7
3  화학  제이슨   2  1.9

-------------------------
학과:  화학 / 학년:  3

   학과   이름  학년   학점
7  화학  엘리스   3  3.1

# 시계열데이터기초

- DatetimeIndex 자료형 사용
- pd.to_datetime()
- Down-sampling 을 자주 하게됨 (일 단위 -> 월 단위 -> 년 단위)
- Up-sampling: 실제로 존재하지 않는 데이터를 만듬 (Forward filling, Backword filling)
  - 처음 데이터를 기준으로, 마지막 데이터를 기준으로 하느냐에 따라 Forward, Backword라고 함

#### Time Plot 시간그래프 pd.DataFrame.plot()
- 패턴, 이상치, 시간에 따른 변화, 계절성 등을 시각적으로 파악하기 용이

In [164]:
date1 = ['2022 01 01', '2022 02 01', '2022 03 01', '2022 04 01']
date_idx1 = pd.to_datetime(date1)


# 위와 같이 다양한 방식으로 날짜를 넣어주면 처리를 해주는 to_datetime 메소드

In [166]:
date3 = ['2022/01/01', '2022/02/01', '2022/03/01', '2022/04/01']
date_idx3 = pd.to_datetime(date3)

In [167]:
date4 = ['2022,01,01', '2022,02,01', '2022,03,01', '2022,04,01']
date_idx4 = pd.to_datetime(date4)

In [170]:
series = pd.Series(np.randint(3, 10, 4), index=date_idx4)

series

AttributeError: module 'numpy' has no attribute 'randint'